Revit 2024 API
BuiltInFailures.RoomFailures.RoomsReallyFailed Property
 [Room] computations failed. Try to modify the following elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId RoomsReallyFailed { get; }
Visual Basic
Public Shared ReadOnly Property RoomsReallyFailed As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ RoomsReallyFailed {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace